import {createSlice} from "@reduxjs/toolkit";

const INTERMEDIATE_DATASET = [
    ["Необхідна надійність ПЗ", [0.75, 0.88, 1, 1.15, 1.40, "n/a"]],
    ["Розмір БД додатка", ["n/a", 0.94, 1, 1.08, 1.16, "n/a"]],
    ["Складність продукту", [0.70, 0.85, 1, 1.15, 1.30, 1.65]],
    ["Обмеження швидкодії при виконанні програми", ["n/a", "n/a", 1, 1.11, 1.30, 1.66]],
    ["Обмеження пам'яті", ["n/a", "n/a", 1, 1.06, 1.21, 1.56]],
    ["Нестійкість оточення віртуальної машини", ["n/a", 0.87, 1, 1.15, 1.30, "n/a"]],
    ["Необхідний час відновлення", ["n/a", 0.87, 1, 1.07, 1.15, "n/a"]],
    ["Аналітичні здібності", [1.46, 1.19, 1, 0.86, 0.71, "n/a"]],
    ["Досвід розробки", [1.29, 1.13, 1, 0.91, 0.82, "n/a"]],
    ["Здібності до розробки ПЗ", [1.42, 1.17, 1, 0.86, 0.70, "n/a"]],
    ["Досвід використання віртуальних машин", [1.21, 1.10, 1, 0.90, "n/a", "n/a"]],
    ["Досвід розробки на мовах програмування", [1.14, 1.07, 1, 0.95, "n/a", "n/a"]],
    ["Застосування методів розробки ПЗ", [1.24, 1.10, 1, 0.91, 0.82, "n/a"]],
    ["Використання інструментарію розробки", [1.24, 1.10, 1, 0.91, 0.83, "n/a"]],
    ["Вимоги дотримання графіка розробки", [1.23, 1.08, 1, 1.04, 1.10, "n/a"]],
];

const INITIAL_PARAMETERS = {
    0: 0.75,
    1: "n/a",
    2: 0.70,
    3: "n/a",
    4: "n/a",
    5: "n/a",
    6: "n/a",
    7: 1.46,
    8: 1.29,
    9: 1.42,
    10: 1.21,
    11: 1.14,
    12: 1.24,
    13: 1.24,
    14: 1.23,
}

const cocomo1Slice = createSlice({
    name: 'cocomo1',
    initialState: {
        data: INTERMEDIATE_DATASET.map(item => item[1]),
        full: INTERMEDIATE_DATASET,
        selected: INITIAL_PARAMETERS,
    },
    reducers: {
        changeSelectedOption(state, action) {
            state.selected[action.payload.id] = action.payload.select;
        }
    }
});

export const cocomo1Actions = cocomo1Slice.actions;

export default cocomo1Slice;